swift-embedded/stm32/Keil.STM32F4xx_DFP.2.13.0/MDK/Boards/ST/32F469IDISCOVERY/Common/LCDConf.c
  GUI_USE_PARA(OffFG);
  GUI_USE_PARA(OffDest);
  for (y = 0U; y < ySize; y++) {
    //
    // Invert alpha values
    //
    _InvertAlpha(pFG, _pBuffer_FG, xSize);
    _InvertAlpha(pBG, _pBuffer_BG, xSize);
    //
    //
    //
    _DMA_MixColorsBulk(_pBuffer_FG, _pBuffer_BG, _pBuffer_DMA2D, Intens, xSize);
    //
    //
    //
    _InvertAlpha(_pBuffer_DMA2D, pDst, xSize);
    pFG  += xSize + OffFG;
    pBG  += xSize + OffBG;
    pDst += xSize + OffDest;
  }
}

/*********************************************************************
*
*       _LCD_DisplayOn
*/
static void _LCD_DisplayOn(void) {
  //
  // Display On
  //
  __HAL_LTDC_ENABLE(&LTDC_Handle);
  HAL_DSI_ShortWrite(&DSI_Handle,
                     DSI_Video_Handle.VirtualChannelID,
                     DSI_DCS_SHORT_PKT_WRITE_P1,
                     OTM8009A_CMD_DISPON,
                     0x00);
  LCD_X_DisplayOn();
}

/*********************************************************************
*
*       _LCD_DisplayOff
*/
static void _LCD_DisplayOff(void) {
  //
  // Display Off
  //
  __HAL_LTDC_DISABLE(&LTDC_Handle);
  HAL_DSI_ShortWrite(&DSI_Handle,
                      DSI_Video_Handle.VirtualChannelID,
                      DSI_DCS_SHORT_PKT_WRITE_P1,
                      OTM8009A_CMD_DISPOFF,
                      0x00);
  LCD_X_DisplayOff();
}

/*********************************************************************
*
*       _LCD_InitController
*/
static void _LCD_InitController(int LayerIndex) {
  LTDC_LayerCfgTypeDef LayerCfg;
  DSI_PLLInitTypeDef   DSIPllInit;
  unsigned int         i;
  int                  xSize, ySize, BitsPerPixel;
  static int           Initialized = 0;

  if (LayerIndex >= GUI_NUM_LAYERS) {
    return;
  }
  if (Initialized == 0) {
    BSP_SDRAM_Init();

    //
    // Configure the LCD pins and clocking
    //
    LCD_X_Init();

    //
    // Clock configuration
    //
    __HAL_RCC_LTDC_CLK_ENABLE();
    __HAL_RCC_LTDC_FORCE_RESET();
    __HAL_RCC_LTDC_RELEASE_RESET();

    __HAL_RCC_DMA2D_CLK_ENABLE();
    __HAL_RCC_DMA2D_FORCE_RESET();
    __HAL_RCC_DMA2D_RELEASE_RESET();

    __HAL_RCC_DSI_CLK_ENABLE();
    __HAL_RCC_DSI_FORCE_RESET();
    __HAL_RCC_DSI_RELEASE_RESET();

    HAL_NVIC_SetPriority(LTDC_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(LTDC_IRQn);

    HAL_NVIC_SetPriority(DMA2D_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(DMA2D_IRQn);

    //
    // DSI Host configuration
    //
    // Configure DSI PLL
    //
    DSIPllInit.PLLNDIV = 100;
    DSIPllInit.PLLIDF  = DSI_PLL_IN_DIV5;
    DSIPllInit.PLLODF  = DSI_PLL_OUT_DIV1;
    HAL_DSI_Init(&DSI_Handle, &DSIPllInit);

    //
    // DSI Video mode configuration
    //
    HAL_DSI_ConfigVideoMode(&DSI_Handle, &DSI_Video_Handle);
    //
    // Initialize LTDC
    //
    HAL_LTDC_Init(&LTDC_Handle); 
    HAL_LTDC_ProgramLineEvent(&LTDC_Handle, 0);
    //
    // Enable LTDC interrupt
    //
    HAL_NVIC_EnableIRQ(LTDC_IRQn);
    //
    // Enable DMA2D interrupt
    //
    __HAL_DMA2D_ENABLE_IT(&DMA2D_Handle, DMA2D_IT_TC);
    HAL_NVIC_EnableIRQ(DMA2D_IRQn);

    Initialized = 1;
  }
  //
  // Layer configuration
  //
  if (LCD_GetSwapXYEx(LayerIndex)) {
    xSize = LCD_GetYSizeEx(LayerIndex);
    ySize = LCD_GetXSizeEx(LayerIndex);
  } else {
    xSize = LCD_GetXSizeEx(LayerIndex);
    ySize = LCD_GetYSizeEx(LayerIndex);
  }
  //
  // Windowing configuration
  //
  LayerCfg.WindowX0    = 0U;
  LayerCfg.WindowX1    = (U32)xSize;
  LayerCfg.WindowY0    = 0U;
  LayerCfg.WindowY1    = (U32)ySize;
  LayerCfg.ImageWidth  = (U32)xSize;
  LayerCfg.ImageHeight = (U32)ySize;
  //
  // Pixel Format configuration
  //
  LayerCfg.PixelFormat = _GetPixelformat(LayerIndex);
  //
  // Alpha constant (255 totally opaque)
  //
  LayerCfg.Alpha  = 255;
  LayerCfg.Alpha0 = 0;
  //
  // Back Color configuration
  //
  LayerCfg.Backcolor.Blue  = 0;
  LayerCfg.Backcolor.Green = 0;
  LayerCfg.Backcolor.Red   = 0;
  //
  // Configure blending factors
  //
  LayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  LayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
  //
  // Input Address configuration
  //
  LayerCfg.FBStartAdress = _aAddr[LayerIndex];
  //
  // Configure Layer
  //
  HAL_LTDC_ConfigLayer(&LTDC_Handle, &LayerCfg, (U32)LayerIndex);
  //
  // Enable LUT on demand
  //
  BitsPerPixel = LCD_GetBitsPerPixelEx(LayerIndex);
  if (BitsPerPixel <= 8) {
    //
    // Enable usage of LUT for all modes with <= 8bpp
    //
    HAL_LTDC_EnableCLUT(&LTDC_Handle, (U32)LayerIndex);
  } else {
    //
    // Optional CLUT initialization for AL88 mode (16bpp)
    //
    if (_apColorConvAPI[LayerIndex] == GUICC_88666I) {
      for (i = 0U; i < 256U; i++) {
        _CLUT[i] = LCD_API_ColorConv_8666.pfIndex2Color(i);
      }
      HAL_LTDC_ConfigCLUT(&LTDC_Handle, _CLUT, 256, (U32)LayerIndex);
      HAL_LTDC_EnableCLUT(&LTDC_Handle, (U32)LayerIndex);
    }
  }

  HAL_DSI_Start(&DSI_Handle);

  OTM8009A_Init(OTM8009A_FORMAT_RBG565, OTM8009A_ORIENTATION_LANDSCAPE);

}

/*********************************************************************
*
*       _LCD_InitHandle
*/
static void _LCD_InitHandle(void) {
  const unsigned int   LBClk_kHz = 62500;
  const unsigned int   LCDClk    = 48000;

  //
  // DSI Host configuration
  //
  DSI_Handle.Instance = DSI;

  DSI_Handle.Init.NumberOfLanes = DSI_TWO_DATA_LANES;
  DSI_Handle.Init.TXEscapeCkdiv = 4;

  DSI_Video_Handle.VirtualChannelID        = 0;
  DSI_Video_Handle.ColorCoding             = DSI_RGB565;
  DSI_Video_Handle.VSPolarity              = DSI_VSYNC_ACTIVE_HIGH;
  DSI_Video_Handle.HSPolarity              = DSI_HSYNC_ACTIVE_HIGH;
  DSI_Video_Handle.DEPolarity              = DSI_DATA_ENABLE_ACTIVE_HIGH;
  DSI_Video_Handle.Mode                    = DSI_VID_MODE_BURST;
  DSI_Video_Handle.NullPacketSize          = 0xFFF;
  DSI_Video_Handle.NumberOfChunks          = 0;
  DSI_Video_Handle.PacketSize              = XSIZE_PHYS;
  DSI_Video_Handle.HorizontalSyncActive    = (HSW * LBClk_kHz)/LCDClk;
  DSI_Video_Handle.HorizontalBackPorch     = (HBP * LBClk_kHz)/LCDClk;
  DSI_Video_Handle.HorizontalLine          = ((XSIZE_PHYS + HSW + HBP + HFP) * LBClk_kHz)/LCDClk;
  DSI_Video_Handle.VerticalSyncActive      = VSW;
  DSI_Video_Handle.VerticalBackPorch       = VBP;
  DSI_Video_Handle.VerticalFrontPorch      = VFP;
  DSI_Video_Handle.VerticalActive          = YSIZE_PHYS;
  DSI_Video_Handle.LPCommandEnable         = DSI_LP_COMMAND_ENABLE;
  DSI_Video_Handle.LPLargestPacketSize     = 16;
  DSI_Video_Handle.LPVACTLargestPacketSize = 0;

  DSI_Video_Handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;
  DSI_Video_Handle.LPHorizontalBackPorchEnable  = DSI_LP_HBP_ENABLE;
  DSI_Video_Handle.LPVerticalActiveEnable       = DSI_LP_VACT_ENABLE;
  DSI_Video_Handle.LPVerticalFrontPorchEnable   = DSI_LP_VFP_ENABLE;
  DSI_Video_Handle.LPVerticalBackPorchEnable    = DSI_LP_VBP_ENABLE;
  DSI_Video_Handle.LPVerticalSyncActiveEnable   = DSI_LP_VSYNC_ENABLE;

  //
  // LTDC configuration
  //
  LTDC_Handle.Instance = LTDC;
  //
  //
  // Polarity configuration
  //
  LTDC_Handle.Init.HSPolarity = LTDC_HSPOLARITY_AH;  // Horizontal synchronization polarity as active high
  LTDC_Handle.Init.VSPolarity = LTDC_VSPOLARITY_AH;  // Vertical synchronization polarity as active high
  LTDC_Handle.Init.DEPolarity = LTDC_DEPOLARITY_AL;  // Data enable polarity as active low
  LTDC_Handle.Init.PCPolarity = LTDC_PCPOLARITY_IPC; // Pixel clock polarity as input pixel clock
  //
  // Configure R,G,B component values for LCD background color
  //
  LTDC_Handle.Init.Backcolor.Red   = (BK_COLOR >>  0) & 0xFF;
  LTDC_Handle.Init.Backcolor.Green = (BK_COLOR >>  8) & 0xFF;
  LTDC_Handle.Init.Backcolor.Blue  = (BK_COLOR >> 16) & 0xFF;
  //
  // Timing configuration
  //
  LTDC_Handle.Init.HorizontalSync     = HSW - 1;                          // Horizontal synchronization width
  LTDC_Handle.Init.VerticalSync       = VSW - 1;                          // Vertical synchronization height
  LTDC_Handle.Init.AccumulatedHBP     = HSW + HBP - 1;                    // Accumulated horizontal back porch
  LTDC_Handle.Init.AccumulatedVBP     = VSW + VBP - 1;                    // Accumulated vertical back porch
  LTDC_Handle.Init.AccumulatedActiveW = HSW + HBP + XSIZE_PHYS - 1;       // Accumulated active width
  LTDC_Handle.Init.AccumulatedActiveH = VSW + VBP + YSIZE_PHYS - 1;       // Accumulated active height
  LTDC_Handle.Init.TotalWidth         = HSW + HBP + XSIZE_PHYS + HFP - 1; // Total width
  LTDC_Handle.Init.TotalHeigh         = VSW + VBP + YSIZE_PHYS + VFP - 1; // Total height

  //
  // DMA2D configuration
  //
  DMA2D_Handle.Instance = DMA2D;
}

/*********************************************************************
*
*       _GetBufferSize
*/
static U32 _GetBufferSize(int LayerIndex) {
  U32 BufferSize;

